"""HW4 Чернышов Алексей"""


# Создать PR/MR с любыми изменениями либо с выполненным д/з.

def some_foo(arg: str):
    print(arg)


some_foo("Content for merging into master")
